index.org
#+title: Intro to C and C++

* Day 1 Material
** comments
#+begin_src c
  // Anywhere in your C or C++ code you can write your own comments to
  // remind yourself later what you thought when you wrote that code. Or
  // just to add explanations.

  // There are two ways to start a comment. The first one is by using
  // >//<. Every thing you type after a >//< until the end of the line
  // will be a comment and will not be read by the compiler

  /* The second way is starting the comment with >/*< and finishing it
     with the same two characters in reverse order. I cannot type it
     here otherwise the comment would end. Notice that such a comment
     can span multiple lines. */
#+end_src
** basic data types
#+begin_src c
  // In C or C++ you have to declare variables. That means, telling the
  // compiler which types they are. A variable will always have the same
  // type. There are a few basic types (of which I will show you only
  // two now). Later we will also learn how to make our own types.
  // Variable declarations follow the form:

  // <type> <variable_name>;

  // The 'int' data type is used for storing whole numbers
  int i2;
  i2 = 20;

  // You can also combine the declaration and initialization of a
  // variable.
  int i = 10;

  // The data type 'float' is used to store rational numbers
  float f = 12.001;
  float f2;
  f2 = 3.14159265;
#+end_src
** the printf function
#+begin_src c
  // To type out messages on the terminal you can use the 'printf'
  // function. There are also other functions that can output to the
  // terminal but printf is the one which is mostly used. The first
  // parameter for the printf function is a string. You write stings
  // enclosed in double quotation marks.

  // To call functions you put a pair of parentheses after their name
  // and if the function expects any parameters, you also put them
  // inside of the parentheses, separated by commas. To finish the call,
  // you have to put a semicolon (";") at the end.

  // This will output >Hello World!< onto the terminal.
  printf("Hello World!");

  // There are also some special sequences you can use to print on the
  // next line, or insert a tab character. These sequences are:
  //   \n   tells printf to keep printing in the next line
  //   \t   inserts a tab character

  printf("This text\nspans two lines!");

  printf("abc\tde\tf\ng\thi\tjkl\n");
  // will result in:
  // abc   de      f
  // g     hi      jkl

  // To print numbers, you put special markers into the string, and
  // provide the numbers as additional arguments. The markers are
  //   %d for int
  //   %f for float

  // There are more markers and the markers can also be customized but
  // for now let's stick with those

  printf("%d", 123);   // prints >123<
  printf("%f", 12.34); // prints >12.340000<

  // You can specify the format of the output with the string

  printf("Here is a whole number: %d\nand a float: %f", 100, 1.1);
  /* prints:
     Here is a whole number: 100
     and a float: 1.100000
  */
#+end_src
