index.html
<!doctype html>
<html lang="en">
<head>
<title>Intro to C and C++</title>
<!-- 2020-04-10 Fr 22:22 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<meta name="generator" content="Org-mode">
<meta name="author" content="Felix Brendel">

<link  href="https://cdnjs.cloudflare.com/ajax/libs/twitter-bootstrap/3.3.5/css/bootstrap.min.css" rel="stylesheet">

</head>
<body>
<div id="content" class="container">
<div class="row"><div class="col-md-9"><h1 class="title">Intro to C and C++</h1>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Day 1 Material</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> comments</h3>
<div class="outline-text-3" id="text-1-1">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">Anywhere in your C or C++ code you can write your own comments to</span>
<span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">remind yourself later what you thought when you wrote that code. Or</span>
<span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">just to add explanations.</span>

<span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">There are two ways to start a comment. The first one is by using</span>
<span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">&gt;//&lt;. Every thing you type after a &gt;//&lt; until the end of the line</span>
<span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">will be a comment and will not be read by the compiler</span>

<span style="color: #46BA3C; font-style: italic;">/* </span><span style="color: #46BA3C; font-style: italic;">The second way is starting the comment with &gt;/*&lt; and finishing it</span>
<span style="color: #46BA3C; font-style: italic;">   with the same two characters in reverse order. I cannot type it</span>
<span style="color: #46BA3C; font-style: italic;">   here otherwise the comment would end. Notice that such a comment</span>
<span style="color: #46BA3C; font-style: italic;">   can span multiple lines. </span><span style="color: #46BA3C; font-style: italic;">*/</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> basic data types</h3>
<div class="outline-text-3" id="text-1-2">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">In C or C++ you have to declare variables. That means, telling the</span>
<span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">compiler which types they are. A variable will always have the same</span>
<span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">type. There are a few basic types (of which I will show you only</span>
<span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">two now). Later we will also learn how to make our own types.</span>
<span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">Variable declarations follow the form:</span>

<span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">&lt;type&gt; &lt;variable_name&gt;;</span>

<span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">The 'int' data type is used for storing whole numbers</span>
<span style="color: #268bd2;">int</span> <span style="color: #6c71c4;">i2</span>;
i2 = 20;

<span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">You can also combine the declaration and initialization of a</span>
<span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">variable.</span>
<span style="color: #268bd2;">int</span> <span style="color: #6c71c4;">i</span> = 10;

<span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">The data type 'float' is used to store rational numbers</span>
<span style="color: #268bd2;">float</span> <span style="color: #6c71c4;">f</span> = 12.001;
<span style="color: #268bd2;">float</span> <span style="color: #6c71c4;">f2</span>;
f2 = 3.14159265;
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> the printf function</h3>
<div class="outline-text-3" id="text-1-3">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">To type out messages on the terminal you can use the 'printf'</span>
<span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">function. There are also other functions that can output to the</span>
<span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">terminal but printf is the one which is mostly used. The first</span>
<span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">parameter for the printf function is a string. You write stings</span>
<span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">enclosed in double quotation marks.</span>

<span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">To call functions you put a pair of parentheses after their name</span>
<span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">and if the function expects any parameters, you also put them</span>
<span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">inside of the parentheses, separated by commas. To finish the call,</span>
<span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">you have to put a semicolon (";") at the end.</span>

<span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">This will output &gt;Hello World!&lt; onto the terminal.</span>
printf<span style="color: #ff8c00;">(</span><span style="color: #2aa198;">"Hello World!"</span><span style="color: #ff8c00;">)</span>;

<span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">There are also some special sequences you can use to print on the</span>
<span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">next line, or insert a tab character. These sequences are:</span>
<span style="color: #46BA3C; font-style: italic;">//   </span><span style="color: #46BA3C; font-style: italic;">\n   tells printf to keep printing in the next line</span>
<span style="color: #46BA3C; font-style: italic;">//   </span><span style="color: #46BA3C; font-style: italic;">\t   inserts a tab character</span>

printf<span style="color: #ff8c00;">(</span><span style="color: #2aa198;">"This text\nspans two lines!"</span><span style="color: #ff8c00;">)</span>;

printf<span style="color: #ff8c00;">(</span><span style="color: #2aa198;">"abc\tde\tf\ng\thi\tjkl\n"</span><span style="color: #ff8c00;">)</span>;
<span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">will result in:</span>
<span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">abc   de      f</span>
<span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">g     hi      jkl</span>

<span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">To print numbers, you put special markers into the string, and</span>
<span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">provide the numbers as additional arguments. The markers are</span>
<span style="color: #46BA3C; font-style: italic;">//   </span><span style="color: #46BA3C; font-style: italic;">%d for int</span>
<span style="color: #46BA3C; font-style: italic;">//   </span><span style="color: #46BA3C; font-style: italic;">%f for float</span>

<span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">There are more markers and the markers can also be customized but</span>
<span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">for now let's stick with those</span>

printf<span style="color: #ff8c00;">(</span><span style="color: #2aa198;">"%d"</span>, 123<span style="color: #ff8c00;">)</span>;   <span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">prints &gt;123&lt;</span>
printf<span style="color: #ff8c00;">(</span><span style="color: #2aa198;">"%f"</span>, 12.34<span style="color: #ff8c00;">)</span>; <span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">prints &gt;12.340000&lt;</span>

<span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">You can specify the format of the output with the string</span>

printf<span style="color: #ff8c00;">(</span><span style="color: #2aa198;">"Here is a whole number: %d\nand a float: %f"</span>, 100, 1.1<span style="color: #ff8c00;">)</span>;
<span style="color: #46BA3C; font-style: italic;">/* </span><span style="color: #46BA3C; font-style: italic;">prints:</span>
<span style="color: #46BA3C; font-style: italic;">   Here is a whole number: 100</span>
<span style="color: #46BA3C; font-style: italic;">   and a float: 1.100000</span>
<span style="color: #46BA3C; font-style: italic;">*/</span>
</pre>
</div>
</div>
</div>
