index.org
** arrays
#+begin_src c
  // Arrays are containers for multiple instances of a data type with a
  // fixed length

  int a[10]; // declares 'a' as an array of ints with the length 10

  // in general such a definition is in the form of
  // <type> <array_name>[<array_length>];

  // each element can be accessed by the array name and the index you
  // are interested in. Array indices start at 0 and the highest valid
  // index is the array_length -1.

  a[0] = 100; // set the 1st element of a to 100
  a[9] = 5;   // set the 10th element of a to 9

  int b = a[9]; // assign to b the value of a at position 10 (value = 5)

  // if an array is accessed on the left side of an '=', then we are
  // assigning something into the array enty. If it is on the right side
  // we are talking about the value that resides in the entry.
#+end_src
** if conditionals
#+begin_src c
  // If your code has to make decisions you can use "if"-statements.
  // They allow you to execute different code depending on a condition.
  // the form of a basic if is:

  // if (<condition>) {
  //     <code>
  // }

  // in this case, if the <condition> is true, then <code> will be
  // executed, otherwise it will be skipped.

  int a = 10;
  int b = 100;

  if (a < b) {
      printf("a is less than b (%d < %d)", a, b);
  }

  // outputs:
  // a is less than b (10 < 100)

  // You can also add code that should be executed if the condition is
  // not true. You do this by adding an "else" part.

  // if (<condition>) {
  //     <then-code>
  // } else {
  //     <else-code>
  // }


  int a = 100;
  int b = 10;

  if (a < b) {
      printf("a is less than b (%d < %d)", a, b);
  } else {
      printf("a is not less than b (%d !< %d)", a, b);
  }

  // outputs:
  // a is not less than b (100 !< 10)
#+end_src

** while loops
#+begin_src c
  // while loops are used to repeat some code /while/ (as long as) a
  // condition is true. A while loop has the following structure. It is
  // basically like a simple if-statement but runs as long as the
  // condition keeps being true and not only once.

  // while (<condition>) {
  //     <code>
  // }


  // the following code will print the numbers fom 0 to 9
  int i = 0;
  while (i < 10) {
      printf("%d\n", i);
      i = i + 1;
  }
#+end_src

** more about conditions
#+begin_src c
  // There are more expressions you can use as conditionals, for 'if'
  // and 'while':

  // symbol    meaning                  example
  // ---------------------------------------------
  //  <        less than?               10 < 100
  //  <=       less than or equal?      10 <= 100
  //  >        greater than?            100 > 10
  //  >=       greater than or equal?   100 >= 10
  //  ==       same value?              10 == 10
  //  !=       not same value?          12 != 10

  // Notice that you cannot use "=" for comparing values, you have to
  // use "==". A single "=" is used for assigning values to variables.
#+end_src
