index.html
<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> arrays</h3>
<div class="outline-text-3" id="text-1-4">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">Arrays are containers for multiple instances of a data type with a</span>
<span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">fixed length</span>

<span style="color: #268bd2;">int</span> <span style="color: #6c71c4;">a</span><span style="color: #ff8c00;">[</span>10<span style="color: #ff8c00;">]</span>; <span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">declares 'a' as an array of ints with the length 10</span>

<span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">in general such a definition is in the form of</span>
<span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">&lt;type&gt; &lt;array_name&gt;[&lt;array_length&gt;];</span>

<span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">each element can be accessed by the array name and the index you</span>
<span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">are interested in. Array indices start at 0 and the highest valid</span>
<span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">index is the array_length -1.</span>

<span style="color: #268bd2;">a</span><span style="color: #ff8c00;">[</span>0<span style="color: #ff8c00;">]</span> = 100; <span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">set the 1st element of a to 100</span>
<span style="color: #268bd2;">a</span><span style="color: #ff8c00;">[</span>9<span style="color: #ff8c00;">]</span> = 5;   <span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">set the 10th element of a to 9</span>

<span style="color: #268bd2;">int</span> <span style="color: #6c71c4;">b</span> = a<span style="color: #ff8c00;">[</span>9<span style="color: #ff8c00;">]</span>; <span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">assign to b the value of a at position 10 (value = 5)</span>

<span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">if an array is accessed on the left side of an '=', then we are</span>
<span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">assigning something into the array enty. If it is on the right side</span>
<span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">we are talking about the value that resides in the entry.</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-1-5" class="outline-3">
<h3 id="sec-1-5"><span class="section-number-3">1.5</span> if conditionals</h3>
<div class="outline-text-3" id="text-1-5">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">If your code has to make decisions you can use "if"-statements.</span>
<span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">They allow you to execute different code depending on a condition.</span>
<span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">the form of a basic if is:</span>

<span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">if (&lt;condition&gt;) {</span>
<span style="color: #46BA3C; font-style: italic;">//     </span><span style="color: #46BA3C; font-style: italic;">&lt;code&gt;</span>
<span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">}</span>

<span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">in this case, if the &lt;condition&gt; is true, then &lt;code&gt; will be</span>
<span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">executed, otherwise it will be skipped.</span>

<span style="color: #268bd2;">int</span> <span style="color: #6c71c4;">a</span> = 10;
<span style="color: #268bd2;">int</span> <span style="color: #6c71c4;">b</span> = 100;

<span style="color: #859900;">if</span> <span style="color: #ff8c00;">(</span>a &lt; b<span style="color: #ff8c00;">)</span> <span style="color: #ff8c00;">{</span>
    printf<span style="color: #ff1493;">(</span><span style="color: #2aa198;">"a is less than b (%d &lt; %d)"</span>, a, b<span style="color: #ff1493;">)</span>;
<span style="color: #ff8c00;">}</span>

<span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">outputs:</span>
<span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">a is less than b (10 &lt; 100)</span>

<span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">You can also add code that should be executed if the condition is</span>
<span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">not true. You do this by adding an "else" part.</span>

<span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">if (&lt;condition&gt;) {</span>
<span style="color: #46BA3C; font-style: italic;">//     </span><span style="color: #46BA3C; font-style: italic;">&lt;then-code&gt;</span>
<span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">} else {</span>
<span style="color: #46BA3C; font-style: italic;">//     </span><span style="color: #46BA3C; font-style: italic;">&lt;else-code&gt;</span>
<span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">}</span>


<span style="color: #268bd2;">int</span> <span style="color: #6c71c4;">a</span> = 100;
<span style="color: #268bd2;">int</span> <span style="color: #6c71c4;">b</span> = 10;

<span style="color: #859900;">if</span> <span style="color: #ff8c00;">(</span>a &lt; b<span style="color: #ff8c00;">)</span> <span style="color: #ff8c00;">{</span>
    printf<span style="color: #ff1493;">(</span><span style="color: #2aa198;">"a is less than b (%d &lt; %d)"</span>, a, b<span style="color: #ff1493;">)</span>;
<span style="color: #ff8c00;">}</span> <span style="color: #859900;">else</span> <span style="color: #ff8c00;">{</span>
    printf<span style="color: #ff1493;">(</span><span style="color: #2aa198;">"a is not less than b (%d !&lt; %d)"</span>, a, b<span style="color: #ff1493;">)</span>;
<span style="color: #ff8c00;">}</span>

<span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">outputs:</span>
<span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">a is not less than b (100 !&lt; 10)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-6" class="outline-3">
<h3 id="sec-1-6"><span class="section-number-3">1.6</span> while loops</h3>
<div class="outline-text-3" id="text-1-6">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">while loops are used to repeat some code /while/ (as long as) a</span>
<span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">condition is true. A while loop has the following structure. It is</span>
<span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">basically like a simple if-statement but runs as long as the</span>
<span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">condition keeps being true and not only once.</span>

<span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">while (&lt;condition&gt;) {</span>
<span style="color: #46BA3C; font-style: italic;">//     </span><span style="color: #46BA3C; font-style: italic;">&lt;code&gt;</span>
<span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">}</span>


<span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">the following code will print the numbers fom 0 to 9</span>
<span style="color: #268bd2;">int</span> <span style="color: #6c71c4;">i</span> = 0;
<span style="color: #859900;">while</span> <span style="color: #ff8c00;">(</span>i &lt; 10<span style="color: #ff8c00;">)</span> <span style="color: #ff8c00;">{</span>
    printf<span style="color: #ff1493;">(</span><span style="color: #2aa198;">"%d\n"</span>, i<span style="color: #ff1493;">)</span>;
    i = i + 1;
<span style="color: #ff8c00;">}</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-7" class="outline-3">
<h3 id="sec-1-7"><span class="section-number-3">1.7</span> more about conditions</h3>
<div class="outline-text-3" id="text-1-7">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">There are more expressions you can use as conditionals, for 'if'</span>
<span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">and 'while':</span>

<span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">symbol    meaning                  example</span>
<span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">---------------------------------------------</span>
<span style="color: #46BA3C; font-style: italic;">//  </span><span style="color: #46BA3C; font-style: italic;">&lt;        less than?               10 &lt; 100</span>
<span style="color: #46BA3C; font-style: italic;">//  </span><span style="color: #46BA3C; font-style: italic;">&lt;=       less than or equal?      10 &lt;= 100</span>
<span style="color: #46BA3C; font-style: italic;">//  </span><span style="color: #46BA3C; font-style: italic;">&gt;        greater than?            100 &gt; 10</span>
<span style="color: #46BA3C; font-style: italic;">//  </span><span style="color: #46BA3C; font-style: italic;">&gt;=       greater than or equal?   100 &gt;= 10</span>
<span style="color: #46BA3C; font-style: italic;">//  </span><span style="color: #46BA3C; font-style: italic;">==       same value?              10 == 10</span>
<span style="color: #46BA3C; font-style: italic;">//  </span><span style="color: #46BA3C; font-style: italic;">!=       not same value?          12 != 10</span>

<span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">Notice that you cannot use "=" for comparing values, you have to</span>
<span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">use "==". A single "=" is used for assigning values to variables.</span>
</pre>
</div>
</div>
</div>
