index.org
** the scanf function
#+begin_src c
  // To read in values from the user on the terminal, you can use the
  // scanf function, similarly to the printf function, it expects as the
  // first argument a string, that specifies the format of what the user
  // should enter. The same format specifiers apply. The following
  // arguments are expected to be /addresses/ of the variables that we
  // want to set. We did not cover adresses, and wil probably also not
  // cover them next time. In this case, just remember the way to write
  // it.

  // reading in of a integer.
  int a;
  scanf("%d", &a);

  // reading of a floating point value.
  float b;
  scanf("%f", &b);

  // reading of two integers and a floating point number, separated by spaces.
  int c;
  int d;
  float e;
  scanf("%d %d %f", &c, &d, &e);

#+end_src
* Day 1 Practical
** the Hello World program
#+begin_src c
#include <stdio.h>

int main(int argc, char* arg[]) {
    printf("Hello World");

    return 0;
}
#+end_src
** the counting program
#+begin_src c
#include <stdio.h>

int main(int argc, char* arg[]) {

    int i = 0;
    while (i <= 100) {
        printf("%d\n", i);
        i = i + 1;
    }

    return 0;
}
#+end_src

** the factorial program
#+begin_src c
#include <stdio.h>

int main(int argc, char* arg[]) {
    int n;

    printf("Enter a whole number");
    scanf("%d", &n);

    int result = 1;
    int i = 1;

    while (i<=n) {
        result = result * i;

        i = i + 1;
    }

    printf("The result is: %d", result);

    return 0;
}
#+end_src

* Day 1 Homework
** array of factorials
Write a program =fac_array.c= that creates an float array of size 100 and into every index i, writes
$fac(i)$ where $fac$ is the factorial function. After the creation and filling of the array, loop
over it and print every number. A run of that program should look like this:

#+begin_src sh
a.exe

fac(0) = 1.000000
fac(1) = 1.000000
fac(2) = 2.000000
fac(3) = 6.000000
fac(4) = 24.000000
fac(5) = 120.000000
fac(6) = 720.000000
fac(7) = 5040.000000
fac(8) = 40320.000000
fac(9) = 362880.000000
fac(10) = 3628800.000000
....
#+end_src
** prime numbers
Write a program =prime.c= that asks the user for a number and prints out if it is a prime number or
not. For doing this you will need to be able to check if a number is divisible by another number. In
C there is the modulo operator (=%=) that calculates the *rest* of the division.

#+begin_src c
 5 % 2 == 1 // because  5 / 2 == 2 rest 1
 5 % 5 == 0 // because  5 / 5 == 1 rest 0
 5 % 1 == 0 // because  5 / 1 == 5 rest 0
12 % 5 == 2 // because 12 / 5 == 2 rest 2
12 % 3 == 0 // because 12 / 3 == 4 rest 0
#+end_src

So whenever the =a % b= is 0, then a is divisible by b. A interaction with the prime program could
look like this.

#+begin_src sh
a.exe

Enter a whole number: 98
The number 98 is not a prime number (divisible by 49).
#+end_src

or like this

#+begin_src sh
a.exe

Enter a whole number: 97
The number 97 is a prime number.
#+end_src
