index.html
<div id="outline-container-sec-1-8" class="outline-3">
<h3 id="sec-1-8"><span class="section-number-3">1.8</span> the scanf function</h3>
<div class="outline-text-3" id="text-1-8">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">To read in values from the user on the terminal, you can use the</span>
<span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">scanf function, similarly to the printf function, it expects as the</span>
<span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">first argument a string, that specifies the format of what the user</span>
<span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">should enter. The same format specifiers apply. The following</span>
<span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">arguments are expected to be /addresses/ of the variables that we</span>
<span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">want to set. We did not cover adresses, and wil probably also not</span>
<span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">cover them next time. In this case, just remember the way to write</span>
<span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">it.</span>

<span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">reading in of a integer.</span>
<span style="color: #268bd2;">int</span> <span style="color: #6c71c4;">a</span>;
scanf<span style="color: #ff8c00;">(</span><span style="color: #2aa198;">"%d"</span>, &amp;a<span style="color: #ff8c00;">)</span>;

<span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">reading of a floating point value.</span>
<span style="color: #268bd2;">float</span> <span style="color: #6c71c4;">b</span>;
scanf<span style="color: #ff8c00;">(</span><span style="color: #2aa198;">"%f"</span>, &amp;b<span style="color: #ff8c00;">)</span>;

<span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">reading of two integers and a floating point number, separated by spaces.</span>
<span style="color: #268bd2;">int</span> <span style="color: #6c71c4;">c</span>;
<span style="color: #268bd2;">int</span> <span style="color: #6c71c4;">d</span>;
<span style="color: #268bd2;">float</span> <span style="color: #6c71c4;">e</span>;
scanf<span style="color: #ff8c00;">(</span><span style="color: #2aa198;">"%d %d %f"</span>, &amp;c, &amp;d, &amp;e<span style="color: #ff8c00;">)</span>;

</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Day 1 Practical</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> the Hello World program</h3>
<div class="outline-text-3" id="text-2-1">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #d33682;">#include</span> <span style="color: #ff8c00;">&lt;</span><span style="color: #2aa198;">stdio.h</span><span style="color: #ff8c00;">&gt;</span>

<span style="color: #268bd2;">int</span> <span style="color: #b58900;">main</span><span style="color: #ff8c00;">(</span><span style="color: #268bd2;">int</span> <span style="color: #6c71c4;">argc</span>, <span style="color: #268bd2;">char</span>* <span style="color: #6c71c4;">arg</span><span style="color: #ff1493;">[]</span><span style="color: #ff8c00;">)</span> <span style="color: #ff8c00;">{</span>
    printf<span style="color: #ff1493;">(</span><span style="color: #2aa198;">"Hello World"</span><span style="color: #ff1493;">)</span>;

    <span style="color: #859900;">return</span> 0;
<span style="color: #ff8c00;">}</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> the counting program</h3>
<div class="outline-text-3" id="text-2-2">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #d33682;">#include</span> <span style="color: #ff8c00;">&lt;</span><span style="color: #2aa198;">stdio.h</span><span style="color: #ff8c00;">&gt;</span>

<span style="color: #268bd2;">int</span> <span style="color: #b58900;">main</span><span style="color: #ff8c00;">(</span><span style="color: #268bd2;">int</span> <span style="color: #6c71c4;">argc</span>, <span style="color: #268bd2;">char</span>* <span style="color: #6c71c4;">arg</span><span style="color: #ff1493;">[]</span><span style="color: #ff8c00;">)</span> <span style="color: #ff8c00;">{</span>

    <span style="color: #268bd2;">int</span> <span style="color: #6c71c4;">i</span> = 0;
    <span style="color: #859900;">while</span> <span style="color: #ff1493;">(</span>i &lt;= 100<span style="color: #ff1493;">)</span> <span style="color: #ff1493;">{</span>
        printf<span style="color: #7fff00;">(</span><span style="color: #2aa198;">"%d\n"</span>, i<span style="color: #7fff00;">)</span>;
        i = i + 1;
    <span style="color: #ff1493;">}</span>

    <span style="color: #859900;">return</span> 0;
<span style="color: #ff8c00;">}</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> the factorial program</h3>
<div class="outline-text-3" id="text-2-3">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #d33682;">#include</span> <span style="color: #ff8c00;">&lt;</span><span style="color: #2aa198;">stdio.h</span><span style="color: #ff8c00;">&gt;</span>

<span style="color: #268bd2;">int</span> <span style="color: #b58900;">main</span><span style="color: #ff8c00;">(</span><span style="color: #268bd2;">int</span> <span style="color: #6c71c4;">argc</span>, <span style="color: #268bd2;">char</span>* <span style="color: #6c71c4;">arg</span><span style="color: #ff1493;">[]</span><span style="color: #ff8c00;">)</span> <span style="color: #ff8c00;">{</span>
    <span style="color: #268bd2;">int</span> <span style="color: #6c71c4;">n</span>;

    printf<span style="color: #ff1493;">(</span><span style="color: #2aa198;">"Enter a whole number"</span><span style="color: #ff1493;">)</span>;
    scanf<span style="color: #ff1493;">(</span><span style="color: #2aa198;">"%d"</span>, &amp;n<span style="color: #ff1493;">)</span>;

    <span style="color: #268bd2;">int</span> <span style="color: #6c71c4;">result</span> = 1;
    <span style="color: #268bd2;">int</span> <span style="color: #6c71c4;">i</span> = 1;

    <span style="color: #859900;">while</span> <span style="color: #ff1493;">(</span>i&lt;=n<span style="color: #ff1493;">)</span> <span style="color: #ff1493;">{</span>
        result = result * i;

        i = i + 1;
    <span style="color: #ff1493;">}</span>

    printf<span style="color: #ff1493;">(</span><span style="color: #2aa198;">"The result is: %d"</span>, result<span style="color: #ff1493;">)</span>;

    <span style="color: #859900;">return</span> 0;
<span style="color: #ff8c00;">}</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Day 1 Homework</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> array of factorials</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Write a program <code>fac_array.c</code> that creates an float array of size 100 and into every index i, writes
\(fac(i)\) where \(fac\) is the factorial function. After the creation and filling of the array, loop
over it and print every number. A run of that program should look like this:
</p>

<div class="org-src-container">

<pre class="src src-sh">a.exe

<span style="color: #b58900;">fac</span><span style="color: #ff8c00;">(</span>0<span style="color: #ff8c00;">)</span> = 1.000000
<span style="color: #b58900;">fac</span><span style="color: #ff8c00;">(</span>1<span style="color: #ff8c00;">)</span> = 1.000000
<span style="color: #b58900;">fac</span><span style="color: #ff8c00;">(</span>2<span style="color: #ff8c00;">)</span> = 2.000000
<span style="color: #b58900;">fac</span><span style="color: #ff8c00;">(</span>3<span style="color: #ff8c00;">)</span> = 6.000000
<span style="color: #b58900;">fac</span><span style="color: #ff8c00;">(</span>4<span style="color: #ff8c00;">)</span> = 24.000000
<span style="color: #b58900;">fac</span><span style="color: #ff8c00;">(</span>5<span style="color: #ff8c00;">)</span> = 120.000000
<span style="color: #b58900;">fac</span><span style="color: #ff8c00;">(</span>6<span style="color: #ff8c00;">)</span> = 720.000000
<span style="color: #b58900;">fac</span><span style="color: #ff8c00;">(</span>7<span style="color: #ff8c00;">)</span> = 5040.000000
<span style="color: #b58900;">fac</span><span style="color: #ff8c00;">(</span>8<span style="color: #ff8c00;">)</span> = 40320.000000
<span style="color: #b58900;">fac</span><span style="color: #ff8c00;">(</span>9<span style="color: #ff8c00;">)</span> = 362880.000000
<span style="color: #b58900;">fac</span><span style="color: #ff8c00;">(</span>10<span style="color: #ff8c00;">)</span> = 3628800.000000
....
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> prime numbers</h3>
<div class="outline-text-3" id="text-3-2">
<p>
Write a program <code>prime.c</code> that asks the user for a number and prints out if it is a prime number or
not. For doing this you will need to be able to check if a number is divisible by another number. In
C there is the modulo operator (<code>%</code>) that calculates the <b>rest</b> of the division.
</p>

<div class="org-src-container">

<pre class="src src-c"> 5 % 2 == 1 <span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">because  5 / 2 == 2 rest 1</span>
 5 % 5 == 0 <span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">because  5 / 5 == 1 rest 0</span>
 5 % 1 == 0 <span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">because  5 / 1 == 5 rest 0</span>
12 % 5 == 2 <span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">because 12 / 5 == 2 rest 2</span>
12 % 3 == 0 <span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">because 12 / 3 == 4 rest 0</span>
</pre>
</div>

<p>
So whenever the <code>a % b</code> is 0, then a is divisible by b. A interaction with the prime program could
look like this.
</p>

<div class="org-src-container">

<pre class="src src-sh">a.exe

Enter a whole number: 98
The number 98 is not a prime number <span style="color: #ff8c00;">(</span>divisible by 49<span style="color: #ff8c00;">)</span>.
</pre>
</div>

<p>
or like this
</p>

<div class="org-src-container">

<pre class="src src-sh">a.exe

Enter a whole number: 97
The number 97 is a prime number.
</pre>
</div>
</div>
</div>
