index.org
** fibonacci numbers
Write a program =fib.c= that, when run, asks the program for a whole number $n$ and calculates
$fib(n)$, where $fib$ is defined as follows

$$ fib(0) = 1 \\ fib(1) = 1 \\ fib(n) = fib(n-1) + fib(n-2) $$

The frist few fibonacci numbers therefore are:

$$1\ 1\ 2\ 3\ 5\ 8\ 13\ 21\ 34\ 55\dots$$

Runs of the program could look like this:

#+begin_src sh
a.exe

Enter a whole number: 3
fib(3) = 3

a.exe

Enter a whole number: 20
fib(20) = 10946
#+end_src
** babylonian method of finding square roots
   A way to iteratively estimate square roots is [[https://en.wikipedia.org/wiki/Methods_of_computing_square_roots#Babylonian_method][babylonian method of finding square roots]].

   1. Start with an initial guess $x_0$ (1 works, too) of the square root of a number $S$.
   2. Every next estimate $x_{n+1}$ depends on the last one
      $$x_{n+1} = \frac{1}{2}(x_n+\frac{S}{x_n})$$
   3. Repeat step 2 until the desired precision is reached.

   Write a program =sqrt.c= that reads a float from the user and calculates its square root to the
   precision of 6 digits after the decimal point. A run will look like this:

#+begin_src sh
a.exe

Enter any number: 2
The square root of 2.000000 is 1.414214
#+end_src
* Day 1 Homework Solutions
** array of factorials
#+begin_src c
#include <stdio.h>

int main(int argc, char* arg[]) {
    int array_length = 40;
    float array[array_length];

    int array_counter = 0;
    while (array_counter < array_length) {
        array[array_counter] = 1;

        int fac_counter = 1;
        while (fac_counter<=array_counter) {
            array[array_counter] = array[array_counter] * fac_counter;
            fac_counter = fac_counter + 1;
        }

        array_counter = array_counter + 1;
    }

    array_counter = 0;
    while (array_counter < array_length) {
        printf("fac(%d) = %f\n", array_counter, array[array_counter]);
        array_counter = array_counter + 1;
    }

    return 0;
}

#+end_src

** prime numbers
#+begin_src c
#include <stdio.h>

int main(int argc, char* arg[]) {
    int test;

    printf("Enter a whole number: ");
    scanf("%d", &test);

    int largest_divisor = 1;
    int counter = 2;
    while (counter < test) {
        if (test % counter == 0) {
            largest_divisor = counter;
        }
        counter = counter + 1;
    }

    if (largest_divisor == 1) {
        printf("The number %d is a prime number.", test);
    } else {
        printf("The number %d is not a prime number (divisible by %d).", test, largest_divisor);
    }

    return 0;
}
#+end_src
** fibonacci numbers
#+begin_src c
#include <stdio.h>

int main(int argc, char* arg[]) {
    int n;

    printf("Enter a whole number: ");
    scanf("%d", &n);

    int a = 1;
    int b = 1;
    int counter = 0;
    while (counter < n-1) {
        int temp = a;
        a = b;
        b = b + temp;
        counter = counter + 1;
    }

    printf("fib(%d) = %d\n", n, b);

    return 0;
}
#+end_src
