index.html
<div id="outline-container-sec-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> fibonacci numbers</h3>
<div class="outline-text-3" id="text-3-3">
<p>
Write a program <code>fib.c</code> that, when run, asks the program for a whole number \(n\) and calculates
\(fib(n)\), where \(fib\) is defined as follows
</p>

<p>
\[ fib(0) = 1 \\ fib(1) = 1 \\ fib(n) = fib(n-1) + fib(n-2) \]
</p>

<p>
The frist few fibonacci numbers therefore are:
</p>

<p>
\[1\ 1\ 2\ 3\ 5\ 8\ 13\ 21\ 34\ 55\dots\]
</p>

<p>
Runs of the program could look like this:
</p>

<div class="org-src-container">

<pre class="src src-sh">a.exe

Enter a whole number: 3
<span style="color: #b58900;">fib</span><span style="color: #ff8c00;">(</span>3<span style="color: #ff8c00;">)</span> = 3

a.exe

Enter a whole number: 20
<span style="color: #b58900;">fib</span><span style="color: #ff8c00;">(</span>20<span style="color: #ff8c00;">)</span> = 10946
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-3-4" class="outline-3">
<h3 id="sec-3-4"><span class="section-number-3">3.4</span> babylonian method of finding square roots</h3>
<div class="outline-text-3" id="text-3-4">
<p>
A way to iteratively estimate square roots is <a href="https://en.wikipedia.org/wiki/Methods_of_computing_square_roots#Babylonian_method">babylonian method of finding square roots</a>.
</p>

<ol class="org-ol">
<li>Start with an initial guess \(x_0\) (1 works, too) of the square root of a number \(S\).
</li>
<li>Every next estimate \(x_{n+1}\) depends on the last one
\[x_{n+1} = \frac{1}{2}(x_n+\frac{S}{x_n})\]
</li>
<li>Repeat step 2 until the desired precision is reached.
</li>
</ol>

<p>
Write a program <code>sqrt.c</code> that reads a float from the user and calculates its square root to the
precision of 6 digits after the decimal point. A run will look like this:
</p>

<div class="org-src-container">

<pre class="src src-sh">a.exe

Enter any number: 2
The square root of 2.000000 is 1.414214
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Day 1 Homework Solutions</h2>
<div class="outline-text-2" id="text-4">
</div><div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> array of factorials</h3>
<div class="outline-text-3" id="text-4-1">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #d33682;">#include</span> <span style="color: #ff8c00;">&lt;</span><span style="color: #2aa198;">stdio.h</span><span style="color: #ff8c00;">&gt;</span>

<span style="color: #268bd2;">int</span> <span style="color: #b58900;">main</span><span style="color: #ff8c00;">(</span><span style="color: #268bd2;">int</span> <span style="color: #6c71c4;">argc</span>, <span style="color: #268bd2;">char</span>* <span style="color: #6c71c4;">arg</span><span style="color: #ff1493;">[]</span><span style="color: #ff8c00;">)</span> <span style="color: #ff8c00;">{</span>
    <span style="color: #268bd2;">int</span> <span style="color: #6c71c4;">array_length</span> = 40;
    <span style="color: #268bd2;">float</span> <span style="color: #6c71c4;">array</span><span style="color: #ff1493;">[</span>array_length<span style="color: #ff1493;">]</span>;

    <span style="color: #268bd2;">int</span> <span style="color: #6c71c4;">array_counter</span> = 0;
    <span style="color: #859900;">while</span> <span style="color: #ff1493;">(</span>array_counter &lt; array_length<span style="color: #ff1493;">)</span> <span style="color: #ff1493;">{</span>
        array<span style="color: #7fff00;">[</span>array_counter<span style="color: #7fff00;">]</span> = 1;

        <span style="color: #268bd2;">int</span> <span style="color: #6c71c4;">fac_counter</span> = 1;
        <span style="color: #859900;">while</span> <span style="color: #7fff00;">(</span>fac_counter&lt;=array_counter<span style="color: #7fff00;">)</span> <span style="color: #7fff00;">{</span>
            array<span style="color: #00bfff;">[</span>array_counter<span style="color: #00bfff;">]</span> = array<span style="color: #00bfff;">[</span>array_counter<span style="color: #00bfff;">]</span> * fac_counter;
            fac_counter = fac_counter + 1;
        <span style="color: #7fff00;">}</span>

        array_counter = array_counter + 1;
    <span style="color: #ff1493;">}</span>

    array_counter = 0;
    <span style="color: #859900;">while</span> <span style="color: #ff1493;">(</span>array_counter &lt; array_length<span style="color: #ff1493;">)</span> <span style="color: #ff1493;">{</span>
        printf<span style="color: #7fff00;">(</span><span style="color: #2aa198;">"fac(%d) = %f\n"</span>, array_counter, array<span style="color: #00bfff;">[</span>array_counter<span style="color: #00bfff;">]</span><span style="color: #7fff00;">)</span>;
        array_counter = array_counter + 1;
    <span style="color: #ff1493;">}</span>

    <span style="color: #859900;">return</span> 0;
<span style="color: #ff8c00;">}</span>

</pre>
</div>
</div>
</div>

<div id="outline-container-sec-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> prime numbers</h3>
<div class="outline-text-3" id="text-4-2">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #d33682;">#include</span> <span style="color: #ff8c00;">&lt;</span><span style="color: #2aa198;">stdio.h</span><span style="color: #ff8c00;">&gt;</span>

<span style="color: #268bd2;">int</span> <span style="color: #b58900;">main</span><span style="color: #ff8c00;">(</span><span style="color: #268bd2;">int</span> <span style="color: #6c71c4;">argc</span>, <span style="color: #268bd2;">char</span>* <span style="color: #6c71c4;">arg</span><span style="color: #ff1493;">[]</span><span style="color: #ff8c00;">)</span> <span style="color: #ff8c00;">{</span>
    <span style="color: #268bd2;">int</span> <span style="color: #6c71c4;">test</span>;

    printf<span style="color: #ff1493;">(</span><span style="color: #2aa198;">"Enter a whole number: "</span><span style="color: #ff1493;">)</span>;
    scanf<span style="color: #ff1493;">(</span><span style="color: #2aa198;">"%d"</span>, &amp;test<span style="color: #ff1493;">)</span>;

    <span style="color: #268bd2;">int</span> <span style="color: #6c71c4;">largest_divisor</span> = 1;
    <span style="color: #268bd2;">int</span> <span style="color: #6c71c4;">counter</span> = 2;
    <span style="color: #859900;">while</span> <span style="color: #ff1493;">(</span>counter &lt; test<span style="color: #ff1493;">)</span> <span style="color: #ff1493;">{</span>
        <span style="color: #859900;">if</span> <span style="color: #7fff00;">(</span>test % counter == 0<span style="color: #7fff00;">)</span> <span style="color: #7fff00;">{</span>
            largest_divisor = counter;
        <span style="color: #7fff00;">}</span>
        counter = counter + 1;
    <span style="color: #ff1493;">}</span>

    <span style="color: #859900;">if</span> <span style="color: #ff1493;">(</span>largest_divisor == 1<span style="color: #ff1493;">)</span> <span style="color: #ff1493;">{</span>
        printf<span style="color: #7fff00;">(</span><span style="color: #2aa198;">"The number %d is a prime number."</span>, test<span style="color: #7fff00;">)</span>;
    <span style="color: #ff1493;">}</span> <span style="color: #859900;">else</span> <span style="color: #ff1493;">{</span>
        printf<span style="color: #7fff00;">(</span><span style="color: #2aa198;">"The number %d is not a prime number (divisible by %d)."</span>, test, largest_divisor<span style="color: #7fff00;">)</span>;
    <span style="color: #ff1493;">}</span>

    <span style="color: #859900;">return</span> 0;
<span style="color: #ff8c00;">}</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-4-3" class="outline-3">
<h3 id="sec-4-3"><span class="section-number-3">4.3</span> fibonacci numbers</h3>
<div class="outline-text-3" id="text-4-3">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #d33682;">#include</span> <span style="color: #ff8c00;">&lt;</span><span style="color: #2aa198;">stdio.h</span><span style="color: #ff8c00;">&gt;</span>

<span style="color: #268bd2;">int</span> <span style="color: #b58900;">main</span><span style="color: #ff8c00;">(</span><span style="color: #268bd2;">int</span> <span style="color: #6c71c4;">argc</span>, <span style="color: #268bd2;">char</span>* <span style="color: #6c71c4;">arg</span><span style="color: #ff1493;">[]</span><span style="color: #ff8c00;">)</span> <span style="color: #ff8c00;">{</span>
    <span style="color: #268bd2;">int</span> <span style="color: #6c71c4;">n</span>;

    printf<span style="color: #ff1493;">(</span><span style="color: #2aa198;">"Enter a whole number: "</span><span style="color: #ff1493;">)</span>;
    scanf<span style="color: #ff1493;">(</span><span style="color: #2aa198;">"%d"</span>, &amp;n<span style="color: #ff1493;">)</span>;

    <span style="color: #268bd2;">int</span> <span style="color: #6c71c4;">a</span> = 1;
    <span style="color: #268bd2;">int</span> <span style="color: #6c71c4;">b</span> = 1;
    <span style="color: #268bd2;">int</span> <span style="color: #6c71c4;">counter</span> = 0;
    <span style="color: #859900;">while</span> <span style="color: #ff1493;">(</span>counter &lt; n-1<span style="color: #ff1493;">)</span> <span style="color: #ff1493;">{</span>
        <span style="color: #268bd2;">int</span> <span style="color: #6c71c4;">temp</span> = a;
        a = b;
        b = b + temp;
        counter = counter + 1;
    <span style="color: #ff1493;">}</span>

    printf<span style="color: #ff1493;">(</span><span style="color: #2aa198;">"fib(%d) = %d\n"</span>, n, b<span style="color: #ff1493;">)</span>;

    <span style="color: #859900;">return</span> 0;
<span style="color: #ff8c00;">}</span>
</pre>
</div>
</div>
</div>
