index.org
** babylonian method of finding square roots
#+begin_src c
#include <stdio.h>

int main(int argc, char* arg[]) {
    float precision = 0.000001;
    float s;

    printf("Enter any number: ");
    scanf("%f", &s);

    float x_n = 1;
    float x_np1;
    float difference = 1;

    while (difference > precision) {
        x_np1 = (x_n+(s/x_n))*0.5;

        difference = x_np1 - x_n;

        if (difference < 0) {
            difference = -difference;
        }

        x_n = x_np1;
    }

    printf("The square root of %f is %f\n", s, x_np1);

    return 0;
}
#+end_src
* Day 2 Material
** build scripts
#+begin_src bat
  :: a build script is a little program to compile oyur program. While
  :: you /could/ call the compiler every time from the terminal, it gets
  :: more inconvenient as we add more compiler options a simple build
  :: script is just a .bat file that contains the lines you would have
  :: entered in the terminal itself. Later you can call this script from
  :: the terminal and it has the same effect as executing every line in
  :: there manually.

  gcc program.c

  :: at this point you probably wonder why the compiler always outputted
  :: an a.exe file. we can control the name of the output with the "-o"
  :: option:

  gcc -o program program.c

  :: this creates the executable "program.c"
#+end_src
** functions
#+begin_src c
  // Now let's take a look at how we can define our own functions. The
  // syntax for that is:

  // <return_type> <function_name>(<list_of_parameters>) {
  //     <code>
  // }

  // Addidtionally there is the keyword "return" that instructs the
  // function to end and give back the following value to the calling
  // context. This is the same "return" that we always wrote in the main
  // function. So a function that calcualtes the average of two floats
  // can be written as:

  float average(float a, float b) {
      return (a + b) / 2;
  }

  // We can later use that function

  int main(int agc, char* argv[]) {
      float f1 = 12.233;
      float f2 = 3.1313;
      printf("The average of %f and %f is %f", f1, f2, average(f1, f2));
      return 0;
  }

  // outputs: The average of 12.233000 and 3.131300 is 7.682150
#+end_src
