index.html
<div id="outline-container-sec-4-4" class="outline-3">
<h3 id="sec-4-4"><span class="section-number-3">4.4</span> babylonian method of finding square roots</h3>
<div class="outline-text-3" id="text-4-4">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #d33682;">#include</span> <span style="color: #ff8c00;">&lt;</span><span style="color: #2aa198;">stdio.h</span><span style="color: #ff8c00;">&gt;</span>

<span style="color: #268bd2;">int</span> <span style="color: #b58900;">main</span><span style="color: #ff8c00;">(</span><span style="color: #268bd2;">int</span> <span style="color: #6c71c4;">argc</span>, <span style="color: #268bd2;">char</span>* <span style="color: #6c71c4;">arg</span><span style="color: #ff1493;">[]</span><span style="color: #ff8c00;">)</span> <span style="color: #ff8c00;">{</span>
    <span style="color: #268bd2;">float</span> <span style="color: #6c71c4;">precision</span> = 0.000001;
    <span style="color: #268bd2;">float</span> <span style="color: #6c71c4;">s</span>;

    printf<span style="color: #ff1493;">(</span><span style="color: #2aa198;">"Enter any number: "</span><span style="color: #ff1493;">)</span>;
    scanf<span style="color: #ff1493;">(</span><span style="color: #2aa198;">"%f"</span>, &amp;s<span style="color: #ff1493;">)</span>;

    <span style="color: #268bd2;">float</span> <span style="color: #6c71c4;">x_n</span> = 1;
    <span style="color: #268bd2;">float</span> <span style="color: #6c71c4;">x_np1</span>;
    <span style="color: #268bd2;">float</span> <span style="color: #6c71c4;">difference</span> = 1;

    <span style="color: #859900;">while</span> <span style="color: #ff1493;">(</span>difference &gt; precision<span style="color: #ff1493;">)</span> <span style="color: #ff1493;">{</span>
        x_np1 = <span style="color: #7fff00;">(</span>x_n+<span style="color: #00bfff;">(</span>s/x_n<span style="color: #00bfff;">)</span><span style="color: #7fff00;">)</span>*0.5;

        difference = x_np1 - x_n;

        <span style="color: #859900;">if</span> <span style="color: #7fff00;">(</span>difference &lt; 0<span style="color: #7fff00;">)</span> <span style="color: #7fff00;">{</span>
            difference = -difference;
        <span style="color: #7fff00;">}</span>

        x_n = x_np1;
    <span style="color: #ff1493;">}</span>

    printf<span style="color: #ff1493;">(</span><span style="color: #2aa198;">"The square root of %f is %f\n"</span>, s, x_np1<span style="color: #ff1493;">)</span>;

    <span style="color: #859900;">return</span> 0;
<span style="color: #ff8c00;">}</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Day 2 Material</h2>
<div class="outline-text-2" id="text-5">
</div><div id="outline-container-sec-5-1" class="outline-3">
<h3 id="sec-5-1"><span class="section-number-3">5.1</span> build scripts</h3>
<div class="outline-text-3" id="text-5-1">
<div class="org-src-container">

<pre class="src src-bat"><span style="color: #46BA3C; font-style: italic;">:: a build script is a little program to compile oyur program. While</span>
<span style="color: #46BA3C; font-style: italic;">:: you /</span><span style="color: #46BA3C; font-style: italic;">could</span><span style="color: #46BA3C; font-style: italic;">/ call </span><span style="color: #268bd2;">the</span><span style="color: #46BA3C; font-style: italic;"> compiler every time from the terminal, it gets</span>
<span style="color: #46BA3C; font-style: italic;">:: more inconvenient as we add more compiler options a simple build</span>
<span style="color: #46BA3C; font-style: italic;">:: script is just a .bat file that contains the lines you would have</span>
<span style="color: #46BA3C; font-style: italic;">:: entered in the terminal itself. Later you can call </span><span style="color: #268bd2;">this</span><span style="color: #46BA3C; font-style: italic;"> script from</span>
<span style="color: #46BA3C; font-style: italic;">:: the terminal and it has the same effect as executing every line in</span>
<span style="color: #46BA3C; font-style: italic;">:: there manually.</span>

gcc program.c

<span style="color: #46BA3C; font-style: italic;">:: at this point you probably wonder why the compiler always outputted</span>
<span style="color: #46BA3C; font-style: italic;">:: an a.exe file. we can control the name of the output with the "-o"</span>
<span style="color: #46BA3C; font-style: italic;">:: option:</span>

gcc -<span style="color: #268bd2;">o</span> program program.c

<span style="color: #46BA3C; font-style: italic;">:: this creates the executable "program.c"</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-5-2" class="outline-3">
<h3 id="sec-5-2"><span class="section-number-3">5.2</span> functions</h3>
<div class="outline-text-3" id="text-5-2">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">Now let's take a look at how we can define our own functions. The</span>
<span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">syntax for that is:</span>

<span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">&lt;return_type&gt; &lt;function_name&gt;(&lt;list_of_parameters&gt;) {</span>
<span style="color: #46BA3C; font-style: italic;">//     </span><span style="color: #46BA3C; font-style: italic;">&lt;code&gt;</span>
<span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">}</span>

<span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">Addidtionally there is the keyword "return" that instructs the</span>
<span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">function to end and give back the following value to the calling</span>
<span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">context. This is the same "return" that we always wrote in the main</span>
<span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">function. So a function that calcualtes the average of two floats</span>
<span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">can be written as:</span>

<span style="color: #268bd2;">float</span> <span style="color: #b58900;">average</span><span style="color: #ff8c00;">(</span><span style="color: #268bd2;">float</span> <span style="color: #6c71c4;">a</span>, <span style="color: #268bd2;">float</span> <span style="color: #6c71c4;">b</span><span style="color: #ff8c00;">)</span> <span style="color: #ff8c00;">{</span>
    <span style="color: #859900;">return</span> <span style="color: #ff1493;">(</span>a + b<span style="color: #ff1493;">)</span> / 2;
<span style="color: #ff8c00;">}</span>

<span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">We can later use that function</span>

<span style="color: #268bd2;">int</span> <span style="color: #b58900;">main</span><span style="color: #ff8c00;">(</span><span style="color: #268bd2;">int</span> <span style="color: #6c71c4;">agc</span>, <span style="color: #268bd2;">char</span>* <span style="color: #6c71c4;">argv</span><span style="color: #ff1493;">[]</span><span style="color: #ff8c00;">)</span> <span style="color: #ff8c00;">{</span>
    <span style="color: #268bd2;">float</span> <span style="color: #6c71c4;">f1</span> = 12.233;
    <span style="color: #268bd2;">float</span> <span style="color: #6c71c4;">f2</span> = 3.1313;
    printf<span style="color: #ff1493;">(</span><span style="color: #2aa198;">"The average of %f and %f is %f"</span>, f1, f2, average<span style="color: #7fff00;">(</span>f1, f2<span style="color: #7fff00;">)</span><span style="color: #ff1493;">)</span>;
    <span style="color: #859900;">return</span> 0;
<span style="color: #ff8c00;">}</span>

<span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">outputs: The average of 12.233000 and 3.131300 is 7.682150</span>
</pre>
</div>
</div>
</div>
