index.org
** forward declarations
#+begin_src c
  // Note that a function must be defined before it is used, so the
  // program wouldn't compile if the average function was defined under
  // the main function. To still be able to write the functions on a
  // order that makes sense to you and not onyl the compiler, you can
  // just tell the conpiler what functions will come later without
  // actually writing them before.

  // This might sound complicated but this is a core concept of C. You
  // do this by writing just the function header. In our case it would
  // look like this:

  float average(float a, float b);

  // It includes the return type, name, and arguements. Actually the
  // names of the arguments are optional. We can also just write:

  float average(float, float);
#+end_src

#+begin_src c
  // We call this a Forward declaration. With this we gain the freedom
  // to write our functions wherever and in what order we want, so if we
  // want to write the average function after the main function we would
  // do like this:
  #include <stdio.h>

  float average(float, float);

  int main(int agc, char* argv[]) {
      float f1 = 12.233;
      float f2 = 3.1313;
      printf("The average of %f and %f is %f", f1, f2, average(f1, f2));
      return 0;
  }

  float average(float a, float b) {
      return (a + b) / 2;
  }
#+end_src
