index.html
<div id="outline-container-sec-5-3" class="outline-3">
<h3 id="sec-5-3"><span class="section-number-3">5.3</span> forward declarations</h3>
<div class="outline-text-3" id="text-5-3">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">Note that a function must be defined before it is used, so the</span>
<span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">program wouldn't compile if the average function was defined under</span>
<span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">the main function. To still be able to write the functions on a</span>
<span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">order that makes sense to you and not onyl the compiler, you can</span>
<span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">just tell the conpiler what functions will come later without</span>
<span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">actually writing them before.</span>

<span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">This might sound complicated but this is a core concept of C. You</span>
<span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">do this by writing just the function header. In our case it would</span>
<span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">look like this:</span>

<span style="color: #268bd2;">float</span> <span style="color: #b58900;">average</span><span style="color: #ff8c00;">(</span><span style="color: #268bd2;">float</span> <span style="color: #6c71c4;">a</span>, <span style="color: #268bd2;">float</span> <span style="color: #6c71c4;">b</span><span style="color: #ff8c00;">)</span>;

<span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">It includes the return type, name, and arguements. Actually the</span>
<span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">names of the arguments are optional. We can also just write:</span>

<span style="color: #268bd2;">float</span> <span style="color: #b58900;">average</span><span style="color: #ff8c00;">(</span><span style="color: #268bd2;">float</span>, <span style="color: #268bd2;">float</span><span style="color: #ff8c00;">)</span>;
</pre>
</div>

<div class="org-src-container">

<pre class="src src-c"><span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">We call this a Forward declaration. With this we gain the freedom</span>
<span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">to write our functions wherever and in what order we want, so if we</span>
<span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">want to write the average function after the main function we would</span>
<span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">do like this:</span>
<span style="color: #d33682;">#include</span> <span style="color: #ff8c00;">&lt;</span><span style="color: #2aa198;">stdio.h</span><span style="color: #ff8c00;">&gt;</span>

<span style="color: #268bd2;">float</span> <span style="color: #b58900;">average</span><span style="color: #ff8c00;">(</span><span style="color: #268bd2;">float</span>, <span style="color: #268bd2;">float</span><span style="color: #ff8c00;">)</span>;

<span style="color: #268bd2;">int</span> <span style="color: #b58900;">main</span><span style="color: #ff8c00;">(</span><span style="color: #268bd2;">int</span> <span style="color: #6c71c4;">agc</span>, <span style="color: #268bd2;">char</span>* <span style="color: #6c71c4;">argv</span><span style="color: #ff1493;">[]</span><span style="color: #ff8c00;">)</span> <span style="color: #ff8c00;">{</span>
    <span style="color: #268bd2;">float</span> <span style="color: #6c71c4;">f1</span> = 12.233;
    <span style="color: #268bd2;">float</span> <span style="color: #6c71c4;">f2</span> = 3.1313;
    printf<span style="color: #ff1493;">(</span><span style="color: #2aa198;">"The average of %f and %f is %f"</span>, f1, f2, average<span style="color: #7fff00;">(</span>f1, f2<span style="color: #7fff00;">)</span><span style="color: #ff1493;">)</span>;
    <span style="color: #859900;">return</span> 0;
<span style="color: #ff8c00;">}</span>

<span style="color: #268bd2;">float</span> <span style="color: #b58900;">average</span><span style="color: #ff8c00;">(</span><span style="color: #268bd2;">float</span> <span style="color: #6c71c4;">a</span>, <span style="color: #268bd2;">float</span> <span style="color: #6c71c4;">b</span><span style="color: #ff8c00;">)</span> <span style="color: #ff8c00;">{</span>
    <span style="color: #859900;">return</span> <span style="color: #ff1493;">(</span>a + b<span style="color: #ff1493;">)</span> / 2;
<span style="color: #ff8c00;">}</span>
</pre>
</div>
</div>
</div>
