index.org
** splitting the program into multiple files
#+begin_src bat
  :: As you write bigger programs you usually want to split it up into
  :: logic chunks. If you hava a lot of functions that do math, like
  :: calculating averages and doing vector math, it would make sense to
  :: pack them all into a math.c so that they are nice and easy to find
  :: later.

  :: But then how can they be accessed from the main program?

  :: Again we will need to forward declare the functions of our little
  :: math library, and additionally add the math.c file to the compiler
  :: call in the build script so that it will also be compiled:
  gcc -o program program.c math.c
#+end_src

#+begin_src c
  // So the program would look something like this:

  // ----------------- main.c ------------------------
  #include <stdio.h>

  float average(float, float);

  int main(int agc, char* argv[]) {
      float f1 = 12.233;
      float f2 = 3.1313;
      printf("The average of %f and %f is %f", f1, f2, average(f1, f2));
      return 0;
  }
#+end_src

#+begin_src c
  // ----------------- math.c ------------------------
  float average(float a, float b) {
      return (a + b) / 2;
  }
#+end_src

#+begin_src c
  // Still it is kind of bothersome having to manually forward declare
  // all the functions we want to use from math.c So one more step you
  // can do is write a header-file. This is a file only consisting of
  // forward declarations, that we can also #include. it would look like
  // this:

  // ----------------- main.c ------------------------
  #include <stdio.h>
  #include "math.h" // notice the quotations instead of <>

  int main(int agc, char* argv[]) {
      float f1 = 12.233;
      float f2 = 3.1313;
      printf("The average of %f and %f is %f", f1, f2, average(f1, f2));
      return 0;
  }
#+end_src

#+begin_src c
  // ----------------- math.c ------------------------

  // NOTE: We also include math.h here so we don't have to forward
  // declare the functions for this file too..
  #include "math.h"
  float average(float a, float b) {
      return (a + b) / 2;
  }
#+end_src

#+begin_src c
  // ----------------- math.h ------------------------
  float average(float, float);

#+end_src

