index.html
<div id="outline-container-sec-5-4" class="outline-3">
<h3 id="sec-5-4"><span class="section-number-3">5.4</span> splitting the program into multiple files</h3>
<div class="outline-text-3" id="text-5-4">
<div class="org-src-container">

<pre class="src src-bat"><span style="color: #46BA3C; font-style: italic;">:: As you write bigger programs you usually want to split it up into</span>
<span style="color: #46BA3C; font-style: italic;">:: logic chunks. If you hava a lot of functions that do math, like</span>
<span style="color: #46BA3C; font-style: italic;">:: calculating averages and doing vector math, it would make sense to</span>
<span style="color: #46BA3C; font-style: italic;">:: pack them all into a math.c so that they are nice and easy to find</span>
<span style="color: #46BA3C; font-style: italic;">:: later.</span>

<span style="color: #46BA3C; font-style: italic;">:: But then how can they be accessed from the main program?</span>

<span style="color: #46BA3C; font-style: italic;">:: Again we will need to forward declare the functions of our little</span>
<span style="color: #46BA3C; font-style: italic;">:: math library, and additionally add the math.c file to the compiler</span>
<span style="color: #46BA3C; font-style: italic;">:: call </span><span style="color: #268bd2;">in</span><span style="color: #46BA3C; font-style: italic;"> the build script so that it will also be compiled:</span>
gcc -<span style="color: #268bd2;">o</span> program program.c math.c
</pre>
</div>

<div class="org-src-container">

<pre class="src src-c"><span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">So the program would look something like this:</span>

<span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">----------------- main.c ------------------------</span>
<span style="color: #d33682;">#include</span> <span style="color: #ff8c00;">&lt;</span><span style="color: #2aa198;">stdio.h</span><span style="color: #ff8c00;">&gt;</span>

<span style="color: #268bd2;">float</span> <span style="color: #b58900;">average</span><span style="color: #ff8c00;">(</span><span style="color: #268bd2;">float</span>, <span style="color: #268bd2;">float</span><span style="color: #ff8c00;">)</span>;

<span style="color: #268bd2;">int</span> <span style="color: #b58900;">main</span><span style="color: #ff8c00;">(</span><span style="color: #268bd2;">int</span> <span style="color: #6c71c4;">agc</span>, <span style="color: #268bd2;">char</span>* <span style="color: #6c71c4;">argv</span><span style="color: #ff1493;">[]</span><span style="color: #ff8c00;">)</span> <span style="color: #ff8c00;">{</span>
    <span style="color: #268bd2;">float</span> <span style="color: #6c71c4;">f1</span> = 12.233;
    <span style="color: #268bd2;">float</span> <span style="color: #6c71c4;">f2</span> = 3.1313;
    printf<span style="color: #ff1493;">(</span><span style="color: #2aa198;">"The average of %f and %f is %f"</span>, f1, f2, average<span style="color: #7fff00;">(</span>f1, f2<span style="color: #7fff00;">)</span><span style="color: #ff1493;">)</span>;
    <span style="color: #859900;">return</span> 0;
<span style="color: #ff8c00;">}</span>
</pre>
</div>

<div class="org-src-container">

<pre class="src src-c"><span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">----------------- math.c ------------------------</span>
<span style="color: #268bd2;">float</span> <span style="color: #b58900;">average</span><span style="color: #ff8c00;">(</span><span style="color: #268bd2;">float</span> <span style="color: #6c71c4;">a</span>, <span style="color: #268bd2;">float</span> <span style="color: #6c71c4;">b</span><span style="color: #ff8c00;">)</span> <span style="color: #ff8c00;">{</span>
    <span style="color: #859900;">return</span> <span style="color: #ff1493;">(</span>a + b<span style="color: #ff1493;">)</span> / 2;
<span style="color: #ff8c00;">}</span>
</pre>
</div>

<div class="org-src-container">

<pre class="src src-c"><span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">Still it is kind of bothersome having to manually forward declare</span>
<span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">all the functions we want to use from math.c So one more step you</span>
<span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">can do is write a header-file. This is a file only consisting of</span>
<span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">forward declarations, that we can also #include. it would look like</span>
<span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">this:</span>

<span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">----------------- main.c ------------------------</span>
<span style="color: #d33682;">#include</span> <span style="color: #ff8c00;">&lt;</span><span style="color: #2aa198;">stdio.h</span><span style="color: #ff8c00;">&gt;</span>
<span style="color: #d33682;">#include</span> <span style="color: #2aa198;">"math.h"</span> <span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">notice the quotations instead of &lt;&gt;</span>

<span style="color: #268bd2;">int</span> <span style="color: #b58900;">main</span><span style="color: #ff8c00;">(</span><span style="color: #268bd2;">int</span> <span style="color: #6c71c4;">agc</span>, <span style="color: #268bd2;">char</span>* <span style="color: #6c71c4;">argv</span><span style="color: #ff1493;">[]</span><span style="color: #ff8c00;">)</span> <span style="color: #ff8c00;">{</span>
    <span style="color: #268bd2;">float</span> <span style="color: #6c71c4;">f1</span> = 12.233;
    <span style="color: #268bd2;">float</span> <span style="color: #6c71c4;">f2</span> = 3.1313;
    printf<span style="color: #ff1493;">(</span><span style="color: #2aa198;">"The average of %f and %f is %f"</span>, f1, f2, average<span style="color: #7fff00;">(</span>f1, f2<span style="color: #7fff00;">)</span><span style="color: #ff1493;">)</span>;
    <span style="color: #859900;">return</span> 0;
<span style="color: #ff8c00;">}</span>
</pre>
</div>

<div class="org-src-container">

<pre class="src src-c"><span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">----------------- math.c ------------------------</span>

<span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #d0bf8f;">NOTE</span><span style="color: #46BA3C; font-style: italic;">: We also include math.h here so we don't have to forward</span>
<span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">declare the functions for this file too..</span>
<span style="color: #d33682;">#include</span> <span style="color: #2aa198;">"math.h"</span>
<span style="color: #268bd2;">float</span> <span style="color: #b58900;">average</span><span style="color: #ff8c00;">(</span><span style="color: #268bd2;">float</span> <span style="color: #6c71c4;">a</span>, <span style="color: #268bd2;">float</span> <span style="color: #6c71c4;">b</span><span style="color: #ff8c00;">)</span> <span style="color: #ff8c00;">{</span>
    <span style="color: #859900;">return</span> <span style="color: #ff1493;">(</span>a + b<span style="color: #ff1493;">)</span> / 2;
<span style="color: #ff8c00;">}</span>
</pre>
</div>

<div class="org-src-container">

<pre class="src src-c"><span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">----------------- math.h ------------------------</span>
<span style="color: #268bd2;">float</span> <span style="color: #b58900;">average</span><span style="color: #ff8c00;">(</span><span style="color: #268bd2;">float</span>, <span style="color: #268bd2;">float</span><span style="color: #ff8c00;">)</span>;

</pre>
</div>
</div>
</div>
