index.org
** more about loops
#+begin_src c
  // There are two more looping constructs in C that I didn't show you
  // last time. While every loop can be expressed with a simple while
  // loop, the others add some convenience.

  // You might have noticed that for our while loops we always had a
  // variable as the "counter", in the conditino we checked if the
  // counter reached it's limit and in the while body we inceremented or
  // decremented the counter. This exactly what the for-loop was made
  // for. Compare these two loops

  int c = 0;
  while (c < 10) {
      printf("%d\n", c);
      c = c + 1;
  }

  for (int c = 0; c < 10; c = c + 1) {
      printf("%d\n", c);
  }

  // The for loop combines the act of defining a counter variable, a
  // condition when to stop and an action to to after every step.

  // for (<declaration>; <condition>; <action_after_step>) {
  //     <code>
  // }
#+end_src

#+begin_src c
  // There is also another variant of the while loop, the do-while loop.
  // Instead of checking for the condition at the start, it checks at
  // the end, so the loop body is run at least one time.

  // do {
  //     <code>
  // } while(<condition>);

  // here you need a semicolon at the end of the loop.

  int password = 112233;
  int input;
  do {
      printf("Enter the password: ");
      scanf("%d", &input);
  } while(input != password);
#+end_src

#+begin_src c
  // All these loop also give you control to jump to the next iteration,
  // or break out of the loop completely. The keywords fot that are
  // "continue" and "break"

  // Sum up the numbers from 1 to 10 if they are divisible by 2
  int sum = 0;
  for (int i = 1; i <= 10; i = i +1) {
      if (i % 2 != 0) {
          continue;
      }
      sum = sum + i;
  }
#+end_src

#+begin_src c
  // This prints the numbers form 1 to 10 but stops when i == 5
  for (int i = 1; i <= 10; i = i +1) {
      if (i == 5) {
          break;
      }
      printf("%d\n", i);
  }
#+end_src
* Day 2 Homework
** recursive functions
   Recall the definitions of the factorial function $fac(n)$ and the fibonacci function $fib(n)$.

\begin{align}
    fac(0) &= 1 \\
    fac(n) &= n\cdot fac(n-1)\\
    \text{and}  \\
    fib(0) &= 1 \\
    fib(1) &= 1 \\
    fib(n) &= fib(n-1) + fib(n-2)
\end{align}

   Write a program =fac_fib.c= in which you implement the functions =int fac(int n)= and =int
   fib(int n)= *without any loops*. Just implement them the way they are defined mathematically. You
   will need to call the functions themselves in their body to calculate the result. This is called
   a /recursive call/ and these functions are /recursive/. For example, to implement =fac= you will
   need to call =fac= in its body.

   Check if your implementations work in the main function.

