index.html

<div id="outline-container-sec-5-5" class="outline-3">
<h3 id="sec-5-5"><span class="section-number-3">5.5</span> more about loops</h3>
<div class="outline-text-3" id="text-5-5">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">There are two more looping constructs in C that I didn't show you</span>
<span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">last time. While every loop can be expressed with a simple while</span>
<span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">loop, the others add some convenience.</span>

<span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">You might have noticed that for our while loops we always had a</span>
<span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">variable as the "counter", in the conditino we checked if the</span>
<span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">counter reached it's limit and in the while body we inceremented or</span>
<span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">decremented the counter. This exactly what the for-loop was made</span>
<span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">for. Compare these two loops</span>

<span style="color: #268bd2;">int</span> <span style="color: #6c71c4;">c</span> = 0;
<span style="color: #859900;">while</span> <span style="color: #ff8c00;">(</span>c &lt; 10<span style="color: #ff8c00;">)</span> <span style="color: #ff8c00;">{</span>
    printf<span style="color: #ff1493;">(</span><span style="color: #2aa198;">"%d\n"</span>, c<span style="color: #ff1493;">)</span>;
    c = c + 1;
<span style="color: #ff8c00;">}</span>

<span style="color: #859900;">for</span> <span style="color: #ff8c00;">(</span><span style="color: #268bd2;">int</span> <span style="color: #6c71c4;">c</span> = 0; c &lt; 10; c = c + 1<span style="color: #ff8c00;">)</span> <span style="color: #ff8c00;">{</span>
    printf<span style="color: #ff1493;">(</span><span style="color: #2aa198;">"%d\n"</span>, c<span style="color: #ff1493;">)</span>;
<span style="color: #ff8c00;">}</span>

<span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">The for loop combines the act of defining a counter variable, a</span>
<span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">condition when to stop and an action to to after every step.</span>

<span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">for (&lt;declaration&gt;; &lt;condition&gt;; &lt;action_after_step&gt;) {</span>
<span style="color: #46BA3C; font-style: italic;">//     </span><span style="color: #46BA3C; font-style: italic;">&lt;code&gt;</span>
<span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">}</span>
</pre>
</div>

<div class="org-src-container">

<pre class="src src-c"><span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">There is also another variant of the while loop, the do-while loop.</span>
<span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">Instead of checking for the condition at the start, it checks at</span>
<span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">the end, so the loop body is run at least one time.</span>

<span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">do {</span>
<span style="color: #46BA3C; font-style: italic;">//     </span><span style="color: #46BA3C; font-style: italic;">&lt;code&gt;</span>
<span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">} while(&lt;condition&gt;);</span>

<span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">here you need a semicolon at the end of the loop.</span>

<span style="color: #268bd2;">int</span> <span style="color: #6c71c4;">password</span> = 112233;
<span style="color: #268bd2;">int</span> <span style="color: #6c71c4;">input</span>;
<span style="color: #859900;">do</span> <span style="color: #ff8c00;">{</span>
    printf<span style="color: #ff1493;">(</span><span style="color: #2aa198;">"Enter the password: "</span><span style="color: #ff1493;">)</span>;
    scanf<span style="color: #ff1493;">(</span><span style="color: #2aa198;">"%d"</span>, &amp;input<span style="color: #ff1493;">)</span>;
<span style="color: #ff8c00;">}</span> <span style="color: #859900;">while</span><span style="color: #ff8c00;">(</span>input != password<span style="color: #ff8c00;">)</span>;
</pre>
</div>

<div class="org-src-container">

<pre class="src src-c"><span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">All these loop also give you control to jump to the next iteration,</span>
<span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">or break out of the loop completely. The keywords fot that are</span>
<span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">"continue" and "break"</span>

<span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">Sum up the numbers from 1 to 10 if they are divisible by 2</span>
<span style="color: #268bd2;">int</span> <span style="color: #6c71c4;">sum</span> = 0;
<span style="color: #859900;">for</span> <span style="color: #ff8c00;">(</span><span style="color: #268bd2;">int</span> <span style="color: #6c71c4;">i</span> = 1; i &lt;= 10; i = i +1<span style="color: #ff8c00;">)</span> <span style="color: #ff8c00;">{</span>
    <span style="color: #859900;">if</span> <span style="color: #ff1493;">(</span>i % 2 != 0<span style="color: #ff1493;">)</span> <span style="color: #ff1493;">{</span>
        <span style="color: #859900;">continue</span>;
    <span style="color: #ff1493;">}</span>
    sum = sum + i;
<span style="color: #ff8c00;">}</span>
</pre>
</div>

<div class="org-src-container">

<pre class="src src-c"><span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">This prints the numbers form 1 to 10 but stops when i == 5</span>
<span style="color: #859900;">for</span> <span style="color: #ff8c00;">(</span><span style="color: #268bd2;">int</span> <span style="color: #6c71c4;">i</span> = 1; i &lt;= 10; i = i +1<span style="color: #ff8c00;">)</span> <span style="color: #ff8c00;">{</span>
    <span style="color: #859900;">if</span> <span style="color: #ff1493;">(</span>i == 5<span style="color: #ff1493;">)</span> <span style="color: #ff1493;">{</span>
        <span style="color: #859900;">break</span>;
    <span style="color: #ff1493;">}</span>
    printf<span style="color: #ff1493;">(</span><span style="color: #2aa198;">"%d\n"</span>, i<span style="color: #ff1493;">)</span>;
<span style="color: #ff8c00;">}</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Day 2 Homework</h2>
<div class="outline-text-2" id="text-6">
</div><div id="outline-container-sec-6-1" class="outline-3">
<h3 id="sec-6-1"><span class="section-number-3">6.1</span> recursive functions</h3>
<div class="outline-text-3" id="text-6-1">
<p>
Recall the definitions of the factorial function \(fac(n)\) and the fibonacci function \(fib(n)\).
</p>

\begin{align}
    fac(0) &= 1 \\
    fac(n) &= n\cdot fac(n-1)\\
    \text{and}  \\
    fib(0) &= 1 \\
    fib(1) &= 1 \\
    fib(n) &= fib(n-1) + fib(n-2)
\end{align}

<p>
Write a program <code>fac_fib.c</code> in which you implement the functions <code>int fac(int n)</code> and <code>int
   fib(int n)</code> <b>without any loops</b>. Just implement them the way they are defined mathematically. You
will need to call the functions themselves in their body to calculate the result. This is called
a <i>recursive call</i> and these functions are <i>recursive</i>. For example, to implement <code>fac</code> you will
need to call <code>fac</code> in its body.
</p>

<p>
Check if your implementations work in the main function.
</p>
</div>
</div>
