index.org
** tiny calculator
   Setup a a simple project:
    1) create a new folder =tiny_calc=
    2) in there create:
      - =tiny_calc.c=
      - =math.c=
      - =math.h=
      - =build.bat=

   This =build.bat= will compile the program and run it, but only run it, if there was no error
   (that's what =|| exit /B 1= does). Also it will not show the commands itself in the terminal
   again, only their output (that is what =@echo off= does). You can reuse this build.bat for your
   future projects.

#+begin_src bat
@echo off

gcc -o tiny_calc.exe tiny_calc.c math.c || exit /B 1

tiny_calc.exe
#+end_src

   The =main= function will be in =tiny_calc.c= that will asks the user what he wants to calcualte.
   The interface would look something like this:

#+begin_src sh
Welcome to Tiny_Calc!

What do you want to calculate?
 (1) avrg(a, b)    -- average of two numbers
 (2) max(a, b)     -- maximum of two numbers
 (3) min(a, b)     -- minimum of two numbers
 (4) vlen(x, y, z) -- length of a vector
 (5) sqrt(x)       -- square root of a number
 (5) fib(n)        -- fibonacci of a number
 (6) fac(n)        -- factorial of a number
>>
#+end_src

   The program then expects the user to enter a number between 1 and 6. Depending on the selected
   operation, one or two or three numbers have to be read in from the user. Because that is
   something we will do in all cases, write a function =float read_number()= in =tiny_calc.c= that
   reads floating numbers from the user. Then later, whenever you want to ask the user for a number,
   just call this function. After the user choses an operation and enters the required numbers, the
   result should be printed.


   All the actual math functions should be implemented in =math.c= and be forward declared in
   =math.h=.

   *Notes*:
    - Don't include anything except =<stdio.h>= where you need it
    - The =vlen= function takes in the the three components of a 3d vector as parameters to
      calculate the length you can use $\sqrt{x^2 + y^2 + z^2}$
    - The =sqrt= should calculate to 6 places after the decimal point precision.
    - The =fac= and =fib= functions you can copy from the earlier homework ([[recursive functions]])

** simple game
   Write a small text game that shows a fight between two characters. Both characters have an
   initial health of 100 and both hit each other with random strength (between 0 and 20). You can
   generate random integers with the =int rand()= function. You will need to =#include <stdlib.h>=.
   To prevent generating the same random numbers every time, let the user enter a seed and call the
   =srand(int)= function with the seed as parameter at the start of main.

   A run could look like this:

#+begin_src sh
Enter a seed (number) >> 123123

A hits B with 15  -> A: 100  B: 85
B hits A with 2   -> A: 98   B: 85
< ... >
B hits A with 12   -> A: -3  B: 9

B wins after 8 turns and has 9 health left!
#+end_src

   *Note*: To generate random integers in a given range you can use the =%= operator. For example,
   =rand() % 10= generates random numbers between 0 and 9.

* Day 2 Homework Solutions
** recursive functions
<<hwrec>>
#+begin_src c
  int fac(int n) {
      if (n <= 1)
          return 1;
      return n * fac(n-1);
  }

  int fib(int n) {
      if (n <= 1)
          return 1;
      return fib(n-1) + fib(n-2);
  }
#+end_src

* Day 3 Material
