index.html

<div id="outline-container-sec-6-2" class="outline-3">
<h3 id="sec-6-2"><span class="section-number-3">6.2</span> tiny calculator</h3>
<div class="outline-text-3" id="text-6-2">
<p>
Setup a a simple project:
</p>
<ol class="org-ol">
<li>create a new folder <code>tiny_calc</code>
</li>
<li>in there create:
<ul class="org-ul">
<li><code>tiny_calc.c</code>
</li>
<li><code>math.c</code>
</li>
<li><code>math.h</code>
</li>
<li><code>build.bat</code>
</li>
</ul>
</li>
</ol>

<p>
This <code>build.bat</code> will compile the program and run it, but only run it, if there was no error
(that's what <code>|| exit /B 1</code> does). Also it will not show the commands itself in the terminal
again, only their output (that is what <code>@echo off</code> does). You can reuse this build.bat for your
future projects.
</p>

<div class="org-src-container">

<pre class="src src-bat">@<span style="color: #6c71c4;">echo</span> off

gcc -<span style="color: #268bd2;">o</span> tiny_calc.exe tiny_calc.c math.c || <span style="color: #859900;">exit</span> /<span style="color: #268bd2;">B</span> 1

tiny_calc.exe
</pre>
</div>

<p>
The <code>main</code> function will be in <code>tiny_calc.c</code> that will asks the user what he wants to calcualte.
The interface would look something like this:
</p>

<div class="org-src-container">

<pre class="src src-sh">Welcome to Tiny_Calc!

What do you want to calculate?
 <span style="color: #ff8c00;">(</span>1<span style="color: #ff8c00;">)</span> avrg<span style="color: #ff8c00;">(</span>a, b<span style="color: #ff8c00;">)</span>    -- average of two numbers
 <span style="color: #ff8c00;">(</span>2<span style="color: #ff8c00;">)</span> max<span style="color: #ff8c00;">(</span>a, b<span style="color: #ff8c00;">)</span>     -- maximum of two numbers
 <span style="color: #ff8c00;">(</span>3<span style="color: #ff8c00;">)</span> min<span style="color: #ff8c00;">(</span>a, b<span style="color: #ff8c00;">)</span>     -- minimum of two numbers
 <span style="color: #ff8c00;">(</span>4<span style="color: #ff8c00;">)</span> vlen<span style="color: #ff8c00;">(</span>x, y, z<span style="color: #ff8c00;">)</span> -- length of a vector
 <span style="color: #ff8c00;">(</span>5<span style="color: #ff8c00;">)</span> sqrt<span style="color: #ff8c00;">(</span>x<span style="color: #ff8c00;">)</span>       -- square root of a number
 <span style="color: #ff8c00;">(</span>5<span style="color: #ff8c00;">)</span> fib<span style="color: #ff8c00;">(</span>n<span style="color: #ff8c00;">)</span>        -- fibonacci of a number
 <span style="color: #ff8c00;">(</span>6<span style="color: #ff8c00;">)</span> fac<span style="color: #ff8c00;">(</span>n<span style="color: #ff8c00;">)</span>        -- factorial of a number
&gt;&gt;
</pre>
</div>

<p>
The program then expects the user to enter a number between 1 and 6. Depending on the selected
operation, one or two or three numbers have to be read in from the user. Because that is
something we will do in all cases, write a function <code>float read_number()</code> in <code>tiny_calc.c</code> that
reads floating numbers from the user. Then later, whenever you want to ask the user for a number,
just call this function. After the user choses an operation and enters the required numbers, the
result should be printed.
</p>


<p>
All the actual math functions should be implemented in <code>math.c</code> and be forward declared in
<code>math.h</code>.
</p>

<p>
<b>Notes</b>:
</p>
<ul class="org-ul">
<li>Don't include anything except <code>&lt;stdio.h&gt;</code> where you need it
</li>
<li>The <code>vlen</code> function takes in the the three components of a 3d vector as parameters to
calculate the length you can use \(\sqrt{x^2 + y^2 + z^2}\)
</li>
<li>The <code>sqrt</code> should calculate to 6 places after the decimal point precision.
</li>
<li>The <code>fac</code> and <code>fib</code> functions you can copy from the earlier homework (<a href="#sec-6-1">recursive functions</a>)
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-6-3" class="outline-3">
<h3 id="sec-6-3"><span class="section-number-3">6.3</span> simple game</h3>
<div class="outline-text-3" id="text-6-3">
<p>
Write a small text game that shows a fight between two characters. Both characters have an
initial health of 100 and both hit each other with random strength (between 0 and 20). You can
generate random integers with the <code>int rand()</code> function. You will need to <code>#include &lt;stdlib.h&gt;</code>.
To prevent generating the same random numbers every time, let the user enter a seed and call the
<code>srand(int)</code> function with the seed as parameter at the start of main.
</p>

<p>
A run could look like this:
</p>

<div class="org-src-container">

<pre class="src src-sh">Enter a seed <span style="color: #ff8c00;">(</span>number<span style="color: #ff8c00;">)</span> &gt;&gt; 123123

A hits B with 15  -&gt; A: 100  B: 85
B hits A with 2   -&gt; A: 98   B: 85
&lt; ... &gt;
B hits A with 12   -&gt; A: -3  B: 9

B wins after 8 turns and has 9 health left!
</pre>
</div>

<p>
<b>Note</b>: To generate random integers in a given range you can use the <code>%</code> operator. For example,
<code>rand() % 10</code> generates random numbers between 0 and 9.
</p>
</div>
</div>
</div>

<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> Day 2 Homework Solutions</h2>
<div class="outline-text-2" id="text-7">
</div><div id="outline-container-sec-7-1" class="outline-3">
<h3 id="sec-7-1"><span class="section-number-3">7.1</span> recursive functions</h3>
<div class="outline-text-3" id="text-7-1">
<p>
<a id="hwrec" name="hwrec"></a>
</p>
<div class="org-src-container">

<pre class="src src-c"><span style="color: #268bd2;">int</span> <span style="color: #b58900;">fac</span><span style="color: #ff8c00;">(</span><span style="color: #268bd2;">int</span> <span style="color: #6c71c4;">n</span><span style="color: #ff8c00;">)</span> <span style="color: #ff8c00;">{</span>
    <span style="color: #859900;">if</span> <span style="color: #ff1493;">(</span>n &lt;= 1<span style="color: #ff1493;">)</span>
        <span style="color: #859900;">return</span> 1;
    <span style="color: #859900;">return</span> n * fac<span style="color: #ff1493;">(</span>n-1<span style="color: #ff1493;">)</span>;
<span style="color: #ff8c00;">}</span>

<span style="color: #268bd2;">int</span> <span style="color: #b58900;">fib</span><span style="color: #ff8c00;">(</span><span style="color: #268bd2;">int</span> <span style="color: #6c71c4;">n</span><span style="color: #ff8c00;">)</span> <span style="color: #ff8c00;">{</span>
    <span style="color: #859900;">if</span> <span style="color: #ff1493;">(</span>n &lt;= 1<span style="color: #ff1493;">)</span>
        <span style="color: #859900;">return</span> 1;
    <span style="color: #859900;">return</span> fib<span style="color: #ff1493;">(</span>n-1<span style="color: #ff1493;">)</span> + fib<span style="color: #ff1493;">(</span>n-2<span style="color: #ff1493;">)</span>;
<span style="color: #ff8c00;">}</span>
</pre>
</div>
</div>
</div>
</div>
