index.html

<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> Day 3 Material</h2>
<div class="outline-text-2" id="text-8">
</div><div id="outline-container-sec-8-1" class="outline-3">
<h3 id="sec-8-1"><span class="section-number-3">8.1</span> convenience</h3>
<div class="outline-text-3" id="text-8-1">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">Some convenience features:</span>

<span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">If there is only one thing you want to do inside any loop or an if</span>
<span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">statement, you do not need the curly braces {}. It will look like</span>
<span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">this:</span>

<span style="color: #859900;">if</span> <span style="color: #ff8c00;">(</span>a &lt; b<span style="color: #ff8c00;">)</span>
    printf<span style="color: #ff8c00;">(</span><span style="color: #2aa198;">"a is less than b\n"</span><span style="color: #ff8c00;">)</span>;

<span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">This only works if really you only want to do _one thing_</span>

<span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">The second thing is about incrementing and decrementing variables.</span>
<span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">Until now whenever we want to to increase a variables value by some</span>
<span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">amount we would have to write it like this:</span>

x = x + 5;

<span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">To increment by 5 for example. Instread you can also write the same</span>
<span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">as:</span>

x += 5;

<span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">This has the same meaning and you can use the other arithmetic</span>
<span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">operations like this too.</span>

x += 3 <span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">x = x + 3</span>
x -= 3 <span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">x = x - 3</span>
x *= 3 <span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">x = x * 3</span>
x /= 3 <span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">x = x / 3</span>
x %= 3 <span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">x = x % 3</span>
<span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">etc</span>

<span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">If you only want to increment or decrement a variable by 1 there is</span>
<span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">also a shorthand for that;</span>

i++; <span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">i += 1</span>
i--; <span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">i -= 1</span>

<span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">There is also ++i and --i and they will work the same in this case</span>
<span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">but there is more to them so let's talk another time more about</span>
<span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">them!</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-8-2" class="outline-3">
<h3 id="sec-8-2"><span class="section-number-3">8.2</span> linking boolean expressions</h3>
<div class="outline-text-3" id="text-8-2">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">A boolean expression is an expression that is either true or false,</span>
<span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">like the expression:</span>
3 &lt; 5
<span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">in this case it is true. As you know by now we use boolean</span>
<span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">expression in if-statements or in loops.</span>

<span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">Sometimes however you want to link two boolean expressions together</span>
<span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">for example, how could you write a if-statement that runs if a</span>
<span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">variable a is in the interval between 10 and 20? We would need</span>
<span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">something like this:</span>

<span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">if (a &gt; 9 AND a &lt; 21)</span>

<span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">In C to represent AND and also OR you can use the operators &amp;&amp; and ||</span>
<span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">so the code from before will look like this:</span>

<span style="color: #859900;">if</span> <span style="color: #ff8c00;">(</span>a &gt; 9 &amp;&amp; a &lt; 21<span style="color: #ff8c00;">)</span>
    printf<span style="color: #ff8c00;">(</span><span style="color: #2aa198;">"a is in the range [10, 20]\n"</span><span style="color: #ff8c00;">)</span>;

<span style="color: #859900;">if</span> <span style="color: #ff8c00;">(</span>a % 5 == 0 || a % 3 == 0<span style="color: #ff8c00;">)</span>
    printf<span style="color: #ff8c00;">(</span><span style="color: #2aa198;">"a is divisible by 5 or 3 (or also both)\n"</span><span style="color: #ff8c00;">)</span>;

</pre>
</div>
</div>
</div>
<div id="outline-container-sec-8-3" class="outline-3">
<h3 id="sec-8-3"><span class="section-number-3">8.3</span> structs</h3>
<div class="outline-text-3" id="text-8-3">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">One really important feature of modern programming languages is</span>
<span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">being able to define your own data types, we are not bound to use</span>
<span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">the few built-in types. If you want to combine multiple variables</span>
<span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">into a single type you use a &gt;struct&lt;. Here is how you define a</span>
<span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">custom data type for a 3 dimensional vector, that contains three</span>
<span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">floating point numbers.</span>

<span style="color: #859900;">struct</span> <span style="color: #268bd2;">Vector</span> <span style="color: #ff8c00;">{</span>
    <span style="color: #268bd2;">float</span> <span style="color: #6c71c4;">x</span>;
    <span style="color: #268bd2;">float</span> <span style="color: #6c71c4;">y</span>;
    <span style="color: #268bd2;">float</span> <span style="color: #6c71c4;">z</span>;
<span style="color: #ff8c00;">}</span>;

<span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">This defines a new type called &gt;struct Vector&lt; that we can then use</span>
<span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">to declare variables or parameters or use as a return type.</span>

<span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">Structs can be passed as parameters to functions and can be</span>
<span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">retruned from functions.</span>

<span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">Taking a vector as a parameter:</span>
<span style="color: #268bd2;">float</span> <span style="color: #b58900;">vec_len</span><span style="color: #ff8c00;">(</span><span style="color: #859900;">struct</span> <span style="color: #268bd2;">Vector</span> <span style="color: #6c71c4;">v</span><span style="color: #ff8c00;">)</span> <span style="color: #ff8c00;">{</span>
    <span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">the members of the struct can be accesses with a &gt;.&lt; after the</span>
    <span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">name of the variable</span>

    <span style="color: #859900;">return</span> sqrt<span style="color: #ff1493;">(</span>v.x * v.x + v.y * v.y + v.z * v.z<span style="color: #ff1493;">)</span>;
<span style="color: #ff8c00;">}</span>

<span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">Returning a vector</span>
<span style="color: #859900;">struct</span> <span style="color: #268bd2;">Vector</span> <span style="color: #b58900;">vec_plus</span><span style="color: #ff8c00;">(</span><span style="color: #859900;">struct</span> <span style="color: #268bd2;">Vector</span> <span style="color: #6c71c4;">v1</span>, <span style="color: #859900;">struct</span> <span style="color: #268bd2;">Vector</span> <span style="color: #6c71c4;">v2</span><span style="color: #ff8c00;">)</span> <span style="color: #ff8c00;">{</span>
    <span style="color: #859900;">struct</span> <span style="color: #268bd2;">Vector</span> <span style="color: #6c71c4;">result</span>;

    result.x = v1.x + v2.x;
    result.y = v1.y + v2.y;
    result.z = v1.z + v2.z;

    <span style="color: #859900;">return</span> result;
<span style="color: #ff8c00;">}</span>
</pre>
</div>
</div>
</div>
</div>
