index.org
** how calling functions and recursion works
As you saw in [[hwrec]], functions can call themselves recursively, but still the computer somehow knows
how to deal with that and produce a meaningful result. Every time you call a function, the computer
remembers the place it will have to go back again after the function returned. The Computer does
that by keeping the function calls on a stack, the *call stack*. Each function call has its own
*stack frame* on the call stack that contains all local variables and parameters the function has.
For example if the =main= function calls a function =foo= and =foo= calls =bar=, over the time the
callstack would have a shape like this: like this:

#+begin_src c
  /**
     |        |      |        |      |        |
     |        |      |        |      |--------|
     |        |      |        |      |  bar   |
     |        |      |--------|      |--------|
     |        |      |  foo   |      |  foo   |
     |--------|      |--------|      |--------|
     |  main  |      |  main  |      |  main  |
     |--------|      |--------|      |--------|
  */
#+end_src

And then as =bar= returns and =foo= returns and main is again the active function the callstack
would evolve backwards:

#+begin_src c
  /**
     |        |      |        |      |        |
     |--------|      |        |      |        |
     |  bar   |      |        |      |        |
     |--------|      |--------|      |        |
     |  foo   |      |  foo   |      |        |
     |--------|      |--------|      |--------|
     |  main  |      |  main  |      |  main  |
     |--------|      |--------|      |--------|
  */
#+end_src

You can imagine a call to =fac(3)= look like this

#+begin_src c
  /**
     |        |   |        |   |        |   |        |   |        |   |        |   |        |
     |        |   |        |   |        |   |--------|   |--------|   |        |   |        |
     |        |   |        |   |        |   | fac(1) |   |    1   |   |        |   |        |
     |        |   |        |   |--------|   |--------|   |--------|   |--------|   |        |
     |        |   |        |   | fac(2) |   | fac(2) |   | fac(2) |   |   1*2  |   |        |
     |        |   |--------|   |--------|   |--------|   |--------|   |--------|   |--------|
     |        |   | fac(3) |   | fac(3) |   | fac(3) |   | fac(3) |   | fac(3) |   |   3*2  |
     |--------|   |--------|   |--------|   |--------|   |--------|   |--------|   |--------|
     |  main  |   |  main  |   |  main  |   |  main  |   |  main  |   |  main  |   |  main  |
     |--------|   |--------|   |--------|   |--------|   |--------|   |--------|   |--------|
  */
#+end_src

** stack memory
In the last section we learned how calls are stacked up ontop of each other on the call stack. The
call stack is not stored inside the CPU; instead it is a region in your RAM that is used for it, the
*stack memory*. Note that we do not explicitly control what goes on the stack, it is done for us
automatically.

One more important thing to remember is, that when a function is called, and a stackframe is
created, *all the parameters are copied*. So if the functions modifies a parameter, the calling
function never sees that change. Consider this example:

#+begin_src c
  #include<stdio.h>

  void change_it(int var) {
      var = 1000;
  }

  int main(int argc, char* argv[]) {
      int var = 10;
      printf("var is: %d\n", var);
      change_it(var);
      printf("var is: %d\n", var);
      return 0;
  }

  // outputs:
  // 10
  // 10
#+end_src

The =var= inside =main= is separate from the =var= in =change_it=, so even if =change_it= modified
the variable, it only changed it's own copy.

