index.html
<div id="outline-container-sec-9" class="outline-2">
<h2 id="sec-9"><span class="section-number-2">9</span> Day 4 Material</h2>
<div class="outline-text-2" id="text-9">
</div><div id="outline-container-sec-9-1" class="outline-3">
<h3 id="sec-9-1"><span class="section-number-3">9.1</span> how calling functions and recursion works</h3>
<div class="outline-text-3" id="text-9-1">
<p>
As you saw in <a href="#hwrec">7.1</a>, functions can call themselves recursively, but still the computer somehow knows
how to deal with that and produce a meaningful result. Every time you call a function, the computer
remembers the place it will have to go back again after the function returned. The Computer does
that by keeping the function calls on a stack, the <b>call stack</b>. Each function call has its own
<b>stack frame</b> on the call stack that contains all local variables and parameters the function has.
For example if the <code>main</code> function calls a function <code>foo</code> and <code>foo</code> calls <code>bar</code>, over the time the
callstack would have a shape like this: like this:
</p>

<div class="org-src-container">

<pre class="src src-c"><span style="color: #d33682;">/**</span>
<span style="color: #d33682;">   |        |      |        |      |        |</span>
<span style="color: #d33682;">   |        |      |        |      |--------|</span>
<span style="color: #d33682;">   |        |      |        |      |  bar   |</span>
<span style="color: #d33682;">   |        |      |--------|      |--------|</span>
<span style="color: #d33682;">   |        |      |  foo   |      |  foo   |</span>
<span style="color: #d33682;">   |--------|      |--------|      |--------|</span>
<span style="color: #d33682;">   |  main  |      |  main  |      |  main  |</span>
<span style="color: #d33682;">   |--------|      |--------|      |--------|</span>
<span style="color: #d33682;">*/</span>
</pre>
</div>

<p>
And then as <code>bar</code> returns and <code>foo</code> returns and main is again the active function the callstack
would evolve backwards:
</p>

<div class="org-src-container">

<pre class="src src-c"><span style="color: #d33682;">/**</span>
<span style="color: #d33682;">   |        |      |        |      |        |</span>
<span style="color: #d33682;">   |--------|      |        |      |        |</span>
<span style="color: #d33682;">   |  bar   |      |        |      |        |</span>
<span style="color: #d33682;">   |--------|      |--------|      |        |</span>
<span style="color: #d33682;">   |  foo   |      |  foo   |      |        |</span>
<span style="color: #d33682;">   |--------|      |--------|      |--------|</span>
<span style="color: #d33682;">   |  main  |      |  main  |      |  main  |</span>
<span style="color: #d33682;">   |--------|      |--------|      |--------|</span>
<span style="color: #d33682;">*/</span>
</pre>
</div>

<p>
You can imagine a call to <code>fac(3)</code> look like this
</p>

<div class="org-src-container">

<pre class="src src-c"><span style="color: #d33682;">/**</span>
<span style="color: #d33682;">   |        |   |        |   |        |   |        |   |        |   |        |   |        |</span>
<span style="color: #d33682;">   |        |   |        |   |        |   |--------|   |--------|   |        |   |        |</span>
<span style="color: #d33682;">   |        |   |        |   |        |   | fac(1) |   |    1   |   |        |   |        |</span>
<span style="color: #d33682;">   |        |   |        |   |--------|   |--------|   |--------|   |--------|   |        |</span>
<span style="color: #d33682;">   |        |   |        |   | fac(2) |   | fac(2) |   | fac(2) |   |   1*2  |   |        |</span>
<span style="color: #d33682;">   |        |   |--------|   |--------|   |--------|   |--------|   |--------|   |--------|</span>
<span style="color: #d33682;">   |        |   | fac(3) |   | fac(3) |   | fac(3) |   | fac(3) |   | fac(3) |   |   3*2  |</span>
<span style="color: #d33682;">   |--------|   |--------|   |--------|   |--------|   |--------|   |--------|   |--------|</span>
<span style="color: #d33682;">   |  main  |   |  main  |   |  main  |   |  main  |   |  main  |   |  main  |   |  main  |</span>
<span style="color: #d33682;">   |--------|   |--------|   |--------|   |--------|   |--------|   |--------|   |--------|</span>
<span style="color: #d33682;">*/</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-9-2" class="outline-3">
<h3 id="sec-9-2"><span class="section-number-3">9.2</span> stack memory</h3>
<div class="outline-text-3" id="text-9-2">
<p>
In the last section we learned how calls are stacked up ontop of each other on the call stack. The
call stack is not stored inside the CPU; instead it is a region in your RAM that is used for it, the
<b>stack memory</b>. Note that we do not explicitly control what goes on the stack, it is done for us
automatically.
</p>

<p>
One more important thing to remember is, that when a function is called, and a stackframe is
created, <b>all the parameters are copied</b>. So if the functions modifies a parameter, the calling
function never sees that change. Consider this example:
</p>

<div class="org-src-container">

<pre class="src src-c"><span style="color: #d33682;">#include</span><span style="color: #ff8c00;">&lt;</span><span style="color: #2aa198;">stdio.h</span><span style="color: #ff8c00;">&gt;</span>

<span style="color: #268bd2;">void</span> <span style="color: #b58900;">change_it</span><span style="color: #ff8c00;">(</span><span style="color: #268bd2;">int</span> <span style="color: #6c71c4;">var</span><span style="color: #ff8c00;">)</span> <span style="color: #ff8c00;">{</span>
    var = 1000;
<span style="color: #ff8c00;">}</span>

<span style="color: #268bd2;">int</span> <span style="color: #b58900;">main</span><span style="color: #ff8c00;">(</span><span style="color: #268bd2;">int</span> <span style="color: #6c71c4;">argc</span>, <span style="color: #268bd2;">char</span>* <span style="color: #6c71c4;">argv</span><span style="color: #ff1493;">[]</span><span style="color: #ff8c00;">)</span> <span style="color: #ff8c00;">{</span>
    <span style="color: #268bd2;">int</span> <span style="color: #6c71c4;">var</span> = 10;
    printf<span style="color: #ff1493;">(</span><span style="color: #2aa198;">"var is: %d\n"</span>, var<span style="color: #ff1493;">)</span>;
    change_it<span style="color: #ff1493;">(</span>var<span style="color: #ff1493;">)</span>;
    printf<span style="color: #ff1493;">(</span><span style="color: #2aa198;">"var is: %d\n"</span>, var<span style="color: #ff1493;">)</span>;
    <span style="color: #859900;">return</span> 0;
<span style="color: #ff8c00;">}</span>

<span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">outputs:</span>
<span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">10</span>
<span style="color: #46BA3C; font-style: italic;">// </span><span style="color: #46BA3C; font-style: italic;">10</span>
</pre>
</div>

<p>
The <code>var</code> inside <code>main</code> is separate from the <code>var</code> in <code>change_it</code>, so even if <code>change_it</code> modified
the variable, it only changed it's own copy.
</p>
</div>
</div>
